stroka = input("Введите слово ")
print(stroka) # Введённое слово
print(stroka[2]) # Выводим 3 символ
print(stroka[-2]) # Выводим предпоследний символ
print(stroka[:5]) # Выводим первые пять символов
print(stroka[:-2]) # отсекаем последние два символа
print(stroka[1::2]) # выводим четные символы
print(stroka[2::3]) # выводим нечетные символы
print(stroka[::-1]) # все символы в обратном порядке
print(stroka[::-2]) # Символы в обратном порядке через один
print(len(stroka)) # выводим количество символов в строке
